test/tests/multiapps/energy_conserved_in_simple_conduction_example/buoyantCavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \\    /   O peration     | Version:  10                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

/*--------------------------------*- C++ -*----------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (0 0 0)  // 0
    (1 0 0)  // 1
    (1 1 0)  // 2
    (0 1 0)  // 3
    (0 0 1)  // 4
    (1 0 1)  // 5
    (1 1 1)  // 6
    (0 1 1)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

boundary
(
    back
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 4 5)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 3 4 7)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 2 5 6)
        );
    }
    top
    {
        type wall;
        faces
        (
            (2 3 6 7)
        );
    }
    front
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);
