test/tests/multiapps/energy_conserved_in_simple_conduction_example/buoyantCavity/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.966183044228142;

boundaryField
{
    back
    {
        type            calculated;
        value           uniform 0.966183044228142;
    }
    bottom
    {
        type            calculated;
        value           uniform 0.966183044228142;
    }
    left
    {
        type            calculated;
        value           uniform 0.966183044228142;
    }
    right
    {
        type            calculated;
        value           uniform 0.966183044228142;
    }
    top
    {
        type            calculated;
        value           uniform 0.966183044228142;
    }
    front
    {
        type            calculated;
        value           uniform 0.966183044228142;
    }
}


// ************************************************************************* //
